lab111/app/controllers/calc_controller.rb

  def view
    if result = Posl.find_by_inputed(params[:v2])
      @inputed = result.inputed
      @all = result.all
      @kolvo_posl = result.kolvo
      @max_posl = result.max_p
      else
      processing(params[:v2])
      if @kolvo_posl != 0
        Posl.create :inputed => @inputed,
          :all => @all,
          :kolvo => @kolvo_posl,
          :max_p => @max_posl
---
SELECT  "posls".* FROM "posls" WHERE "posls"."inputed" = ? LIMIT ?  [["inputed", "5 25 23 23 1 2 4 5 5"], ["LIMIT", 1]]
INSERT INTO "posls" ("inputed", "all", "kolvo", "max_p", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def xml
    @xml = Posl.all
---
SELECT "posls".* FROM "posls"